PARAMETERS SAVED FROM THE TRAINING

 This model has been trained for learning the first 6 digits from the MNIST dataset, this is the ORIGINAL MODEL

 Batch size:       32
 Epochs:           5
 Metrics:          ['accuracy']
 Optimizer:        adam
 Loss:             SparseCategoricalCrossentropy 

Model: "sequential_10"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_30 (Conv2D)           (None, 26, 26, 16)        160       
_________________________________________________________________
conv2d_31 (Conv2D)           (None, 24, 24, 16)        2320      
_________________________________________________________________
max_pooling2d_16 (MaxPooling (None, 12, 12, 16)        0         
_________________________________________________________________
conv2d_32 (Conv2D)           (None, 10, 10, 16)        2320      
_________________________________________________________________
conv2d_33 (Conv2D)           (None, 8, 8, 16)          2320      
_________________________________________________________________
max_pooling2d_17 (MaxPooling (None, 4, 4, 16)          0         
_________________________________________________________________
dropout_8 (Dropout)          (None, 4, 4, 16)          0         
_________________________________________________________________
flatten_8 (Flatten)          (None, 256)               0         
_________________________________________________________________
dense_16 (Dense)             (None, 256)               65792     
_________________________________________________________________
dense_17 (Dense)             (None, 6)                 1542      
=================================================================
Total params: 74,454
Trainable params: 74,454
Non-trainable params: 0
_________________________________________________________________
