PARAMETERS SAVED FROM THE TRAINING

 This model has been trained for learning the first 6 digits from the MNIST dataset, this is the ORIGINAL MODEL

 Batch size:       32
 Epochs:           40
 Metrics:          ['accuracy']
 Optimizer:        adam
 Loss:             SparseCategoricalCrossentropy 

Model: "functional_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 28, 28, 1)]  0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 28, 28, 32)   320         input_1[0][0]                    
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 28, 28, 24)   792         conv2d[0][0]                     
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 28, 28, 24)   600         conv2d_1[0][0]                   
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 28, 28, 24)   5208        conv2d_1[0][0]                   
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 28, 28, 48)   0           conv2d_2[0][0]                   
                                                                 conv2d_3[0][0]                   
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 14, 14, 48)   0           concatenate[0][0]                
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 14, 14, 24)   1176        max_pooling2d[0][0]              
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 14, 14, 24)   600         conv2d_4[0][0]                   
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 14, 14, 24)   5208        conv2d_4[0][0]                   
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 14, 14, 48)   0           conv2d_5[0][0]                   
                                                                 conv2d_6[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 7, 7, 48)     0           concatenate_1[0][0]              
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 7, 7, 24)     1176        max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 7, 7, 24)     600         conv2d_7[0][0]                   
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 7, 7, 24)     5208        conv2d_7[0][0]                   
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 7, 7, 48)     0           conv2d_8[0][0]                   
                                                                 conv2d_9[0][0]                   
__________________________________________________________________________________________________
global_average_pooling2d (Globa (None, 48)           0           concatenate_2[0][0]              
__________________________________________________________________________________________________
dense (Dense)                   (None, 6)            294         global_average_pooling2d[0][0]   
==================================================================================================
Total params: 21,182
Trainable params: 21,182
Non-trainable params: 0
__________________________________________________________________________________________________
